In [4]:
import pandas as pd
import os
from keplergl import KeplerGl
from pyproj import CRS
import numpy as np
from matplotlib import pyplot as plt

In [7]:
df = pd.read_csv('largedata_weather_trips_2022.csv', usecols=['start_lat','start_lng','end_lat','end_lng','end_station_name', 'member_casual', 'start_station_name'])

In [10]:
df.head()

,start_station_name,end_station_name,start_lat,start_lng,end_lat,end_lng,member_casual
0,Berkeley Pl & 6 Ave,Windsor Pl & 8 Ave,40.676530,-73.978469,40.660906,-73.983074,member
1,21 St & 4 Ave,Degraw St & Smith St,40.662584,-73.995554,40.682915,-73.993182,member
2,48 St & Barnett Ave,Queens Plaza North & Crescent St,40.750016,-73.915409,40.751102,-73.940737,member
3,7 Ave & Central Park South,8 Ave & W 33 St,40.766741,-73.979069,40.751551,-73.993934,member
4,Jerome Ave & W 195 St,Sherman Ave & E 166 St,40.868858,-73.896500,40.831305,-73.917448,member

In [12]:
df.shape

(30689921, 7)

In [16]:
counts = df['member_casual'].value_counts()
counts

member_casual
member    23995071
casual     6694850
Name: count, dtype: int64

In [22]:
# we are removing casual members as their riding trend across temperatures
# is the same as members (as we found out in the previous task) 
#but a lower total number. 

df = df [df['member_casual'] != 'casual']

In [29]:
df.shape

(23995071, 7)

In [31]:
df['value']=1
df_group=df.groupby(['start_station_name' , 'end_station_name'])['value'].count().reset_index()

In [39]:
df_group.rename(columns={'value':'trips'}, inplace=True)

In [41]:
df_group

           start_station_name         end_station_name  trips
0            1 Ave & E 110 St         1 Ave & E 110 St   1183
1            1 Ave & E 110 St          1 Ave & E 18 St      2
2            1 Ave & E 110 St          1 Ave & E 30 St      2
3            1 Ave & E 110 St          1 Ave & E 39 St      1
4            1 Ave & E 110 St          1 Ave & E 44 St     12
...                       ...                      ...    ...
927705  Yankee Ferry Terminal  Water St &  Fletcher St      1
927706  Yankee Ferry Terminal    West St & Chambers St      2
927707  Yankee Ferry Terminal     West St & Liberty St      2
927708  Yankee Ferry Terminal           West Thames St      1
927709  Yankee Ferry Terminal    Yankee Ferry Terminal   1721

[927710 rows x 3 columns]

In [43]:
df_group.describe()

               trips
count  927710.000000
mean       25.817150
std        90.150977
min         1.000000
25%         1.000000
50%         4.000000
75%        15.000000
max      6332.000000

In [45]:
print(df_group ['trips'].sum())
print(df.shape)

23950828
(23995071, 8)

In [ ]:
# try merging


df_m = df_group.merge(df, how = 'outer', on = "start_station_name", indicator = 'merge_flag')

In [49]:
(df_group['trips'] >1).sum()

np.int64(664847)

In [12]:
# Due to the size of the dataframe, we will focus on stations that have more than '1' trip.

df_group2=df_group[df_group['trips'] > 1]

In [13]:
df_group2.shape

(745143, 3)

In [15]:
df1.head()

           start_station_name  start_lat        DATE
0         Berkeley Pl & 6 Ave  40.676530  2022-08-26
1               21 St & 4 Ave  40.662584  2022-08-03
2         48 St & Barnett Ave  40.750016  2022-08-11
3  7 Ave & Central Park South  40.766741  2022-08-10
4       Jerome Ave & W 195 St  40.868858  2022-08-31

In [16]:
df_group2.head()

  start_station_name  end_station_name  trips
0   1 Ave & E 110 St  1 Ave & E 110 St   1473
1   1 Ave & E 110 St   1 Ave & E 18 St      2
2   1 Ave & E 110 St   1 Ave & E 30 St      4
4   1 Ave & E 110 St   1 Ave & E 44 St     12
6   1 Ave & E 110 St   1 Ave & E 62 St     27

In [17]:
df_group2.shape

(745143, 3)

In [33]:
df1.shape

(30689921, 3)

In [ ]:
#kernel keeps crashing

df2 = pd.merge (df_group2, df1, on = 'start_station_name', how = 'left')


example:

df_m = df_group.merge(df_stations, how = 'outer', on = "start_station_name", indicator = 'merge_flag')

In [ ]:
df1.datatypes

# Notes

Remove casual members to reduce data set

Check if kernel still crashes